In [1]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

/Users/kolobj/anaconda/envs/cmu3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/Users/kolobj/anaconda/envs/cmu3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

In [3]:
ser1 = Series(np.arange(3), index=['A','B','C'])
ser1 = 2 * ser1
ser1

A    0
B    2
C    4
dtype: int64

In [4]:
ser1['B']

2

In [7]:
ser1[0]

0

In [11]:
ser1[0:3]

A    0
B    2
C    4
dtype: int64

In [13]:
ser1[['A','C']]

A    0
C    4
dtype: int64

In [17]:
ser1>3

A    False
B    False
C     True
dtype: bool

In [14]:
ser1[ser1>3]

C    4
dtype: int64

In [15]:
ser1[ser1>3] = 10

In [16]:
ser1

A     0
B     2
C    10
dtype: int64

In [49]:
dframe = DataFrame(np.arange(25).reshape(5,5),index=['NYC','LA','SF','DC','CHI'],columns=['A','B','C','D','E'])

In [50]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [52]:
dframe['B']

NYC     1
LA      6
SF     11
DC     16
CHI    21
Name: B, dtype: int64

In [53]:
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
CHI  21  24

In [54]:
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [55]:
dframe > 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
CHI   True   True   True   True   True

In [20]:
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [21]:
dframe.loc[['LA', 'CHI']]

      A   B   C   D   E
LA    5   6   7   8   9
CHI  20  21  22  23  24

In [24]:
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [45]:
serx = Series([2, 0, 1, 2], index=[2,1,7,2])

In [46]:
serx

2    2
1    0
7    1
2    2
dtype: int64

In [48]:
serx.loc[2]

2    2
2    2
dtype: int64

In [43]:
serx.iloc[2]

1